package ch11_20240315;

public class Java20240315 {
    // final은 필드, 지역변수, 메서드, 클래스 앞에 위치할 수 있음
    // final 붙은 것은 수정이 안됨
    // class에 붙은 final은 상속자체가 불가

    // cf) static은 값 고정이 아니라 값 바뀔때 전부 바뀜
    // static은 class당 하나만 존재함
    
    // 클래스에 기본 생성자가 있고 다른 생성자가 있을때
    // 기본 생성자는 나중에 출력이 됨

    // 어떤 객체건 상관없이 object[] 안에 배열을 넣을 수 있음

    // 일반클래스, 추상클래스, 인터페이스 → 이 3개를 정말 잘 이해해야됨
    // 이 중 인터페이스는 spring에 많이 나옴
    // 4주차 시험 : 일반클래스, 추상클래스, 인터페이스, 예외처리
    // + 2차원 배열 넣을지 고민하신다고 함(2차원 배열 시험범위 x - 240329)
    
    // 15장 쓰레드를 제일 나중에 할 예정
    // 5주차 : 제네릭, collection, 람다, 입출력, 쓰레드
    // → 2차원 배열은 5주차 시작하기 전에 할 예정
    // 5주차 시험: 제네릭, collection, 람다, 쓰레드
    
}
