package ch10_20240313;

public class Java20240313 {
    // 오버로딩과 오버라이딩
    // 오버로딩 : 메서드 이름이 같은데 매개변수(시그니쳐)가 다른것
    // 상속과는 관련 X(메소드를 만드는 법)
    // ex) 함수를 오버로딩했다
    // 오버라이딩 : 시그니쳐까지 똑같은 메서드가 여러 개 있는 것(덮어쓰는것 같은 유사한 동작)
    // 상속관계에만 사용함(부모가 가진 메서드를 자식이 바꿔서 쓰는 것)
    // 필드, 메서드를 상속 → 메소드를 상속할때 오버라이딩 하는 것
    // 조건 : 1. 부모 클래스의 메서드와 시그니처 및 리턴 타입이 동일해야함
    //      2. 부모 클래스의 메서드보다 접근 지정자의 범위가 같거나 넓어야 함

    // 메서드 오버라이딩을 사용하는 이유
    // 구조를 잡기 위함
    // @ → 어노테이션(Anotation) : 명시적으로 설명하는 것(주석과 비슷/ intelliJ에서 자동으로 붙여줌)
    // 주석과의 다른 점 : 해석으로 그치는 것이 아니라
    // 실제로 나중에 코드에다 어떠한 기능을 부여
    
    // 333~5p에 해당하는 코드 깃허브에서 찾아서 오후 복습시간에 입력해볼것

    
}
